/**
 *
 *  灰色:没有安排
 *  蓝色:将来
 *  黄色:今天
 *  绿色:过去
 *  TAPD上面没有任务，安排的时候就是灰色的,上面如果有任务，
 *  如果发生在过去就是绿色的，如果发生在今天就是黄色的，如果发生在未来就是蓝色的
 *
 *  公司业务周视图
 * */

// 数据1 项目信息
export const projectData = [
  {
    // 用来表达项目总览 和项目整体信息
    projectId: '111', // 项目ID
    name: '盒DAN',
    status: 0, // 用来表达当前项目整体状态: 进行中 开发中 已完结等
    startDate: '2019-01-01', // 结束时间
    endDate: '2019-03-03', // 开始时间
    url: '', // 项目的链接地址
    des: '付款申请沟通中', // 自定义项目描述
    // ...more  可以添加更多扩展信息
    eventList: [
      {
        eventId: '11111',
        desc: '今天xxx 怎么样了嘻嘻嘻',
        date: '2019-12-11',
      },
      {
        eventId: '222',
        desc: '今天xxx 怎么样了嘻嘻嘻',
        date: '2019-12-13',
      },
      {
        eventId: '333',
        desc: '今天xxxxxx 怎么样了嘻嘻嘻22',
        date: '2019-12-13',
      },
    ],
    roleList: [
      // 用于记录项目所需要的角色
      {
        roleName: '产品1', // 角色名
        roleId: 111, // 角色ID
        des: '设计产品', // 角色描述
        // ...more  可以添加更多角色的字段
        memberList: [
          {
            id: '111',
            name: '张尧11',
            time: ['2019-12-9', '2019-12-13'], // 承担该角色的日期列表
          },
          {
            id: '222',
            name: '张尧22',
            time: ['2019-12-11', '2019-12-12'], // 承担该角色的日期列表
          },
        ],
      },
      {
        roleName: '产品2', // 角色名
        roleId: 222, // 角色ID
        des: '设计产品', // 角色描述
        // ...more  可以添加更多角色的字段
        memberList: [
          {
            id: '111',
            name: '张尧11',
            time: ['2019-12-11', '2019-12-14'], // 承担该角色的日期列表
          },
          {
            id: '222',
            name: '张尧22',
            time: ['2019-12-11', '2019-12-10'], // 承担该角色的日期列表
          },
        ],
      },
      {
        roleName: '产品3', // 角色名
        roleId: 333, // 角色ID
        des: '设计产品', // 角色描述
        // ...more  可以添加更多角色的字段
        memberList: [
          {
            id: '111',
            name: '张尧11',
            time: ['2019-12-11', '2019-12-13'], // 承担该角色的日期列表
          },
          {
            id: '222',
            name: '张尧22',
            time: ['2019-12-14', '2019-12-14'], // 承担该角色的日期列表
          },
        ],
      },
      {
        roleName: 'UI', // 角色名
        roleId: 444, // 角色ID
        des: 'UI界面设计', // 角色描述
        memberList: [
          // 参与该项目角色的人员
          {
            id: '111',
            name: '张尧',
            time: ['2019-12-12', '2019-12-14'], // 承担该角色的日期列表
          },
          {
            id: '222',
            name: '张尧',
            time: ['2019-12-11', '2019-12-13'], // 承担该角色的日期列表
          },
        ],
        // ...more  可以添加更多角色的描述
      },
    ],
  },
  {
    // 用来表达项目总览 和项目整体信息
    projectId: '222', // 项目ID
    name: '盒DAN222222',
    status: 0, // 用来表达当前项目整体状态: 进行中 开发中 已完结等
    startDate: '2019-01-01', // 结束时间
    endDate: '2019-03-03', // 开始时间
    url: '', // 项目的链接地址
    des: '付款申请沟通中', // 自定义项目描述
    // ...more  可以添加更多扩展信息
    eventList: [
      {
        eventId: '111',
        desc: '第1个事件描述描述',
        date: '2019-12-9',
      },
      {
        eventId: '222',
        desc: '第2个事件描述描述',
        date: '2019-12-11',
      },
    ],
    roleList: [
      // 用于记录项目所需要的角色
      {
        roleName: '产品1', // 角色名
        roleId: 111, // 角色ID
        des: '设计产品', // 角色描述
        // ...more  可以添加更多角色的字段
        memberList: [
          {
            id: '111',
            name: '张尧11',
            time: ['2019-12-13', '2019-12-12'], // 承担该角色的日期列表
          },
          {
            id: '222',
            name: '张尧22',
            time: ['2019-12-11', '2019-12-10'], // 承担该角色的日期列表
          },
        ],
      },
      {
        roleName: '产品2', // 角色名
        roleId: 222, // 角色ID
        des: '设计产品', // 角色描述
        // ...more  可以添加更多角色的字段
        memberList: [
          {
            id: '111',
            name: '张尧11',
            time: ['2019-12-15', '2019-12-11'], // 承担该角色的日期列表
          },
          {
            id: '222',
            name: '张尧22',
            time: ['2019-12-10', '2019-12-12'], // 承担该角色的日期列表
          },
        ],
      },
      {
        roleName: '产品3', // 角色名
        roleId: 333, // 角色ID
        des: '设计产品', // 角色描述
        // ...more  可以添加更多角色的字段
        memberList: [
          {
            id: '111',
            name: '张尧11',
            time: ['2019-12-9', '2019-12-11'], // 承担该角色的日期列表
          },
          {
            id: '222',
            name: '张尧22',
            time: ['2019-12-12', '2019-12-13'], // 承担该角色的日期列表
          },
        ],
      },
      {
        roleName: 'UI', // 角色名
        roleId: 444, // 角色ID
        des: 'UI界面设计', // 角色描述
        memberList: [
          // 参与该项目角色的人员
          {
            id: '111',
            name: '张尧',
            time: ['2019-12-14', '2019-12-11'], // 承担该角色的日期列表
          },
          {
            id: '222',
            name: '张尧',
            time: ['2019-12-15', '2019-12-11'], // 承担该角色的日期列表
          },
        ],
        // ...more  可以添加更多角色的描述
      },
    ],
  },
];

// 从项目中新增和删除人员
export const delPeople = {
  peopleId: '111',
  name: '张尧11',
  time: ['2019-12-6'],
  roleId: 111,
  projectId: '111',
};
// 数据2: 所有人员的列表按角色分类
export const peopleData = [
  {
    roleName: 'UI', // 角色名
    roleId: 444, // 角色ID
    des: 'UI界面设计', // 角色描述
    memberList: [
      {
        name: '赵海媚', // 公用名
        id: '123', // 个人身份识别id
        url: '', // 个人链接地址
        // ...more , 更多人员信息
        voc: [
          {
            time: '2019-12-12', // 日期
            task: 5, // 任务
            task_end: 3, // 已完成任务
          },
          {
            time: '2019-12-13', // 日期
            task: 5, // 任务
            task_end: 3, // 已完成任务
          },
        ],
      },
      {
        name: '赵海媚', // 公用名
        id: '123', // 个人身份识别id
        url: '', // 个人链接地址
        // ...more , 更多人员信息
        voc: [
          {
            time: '2019-12-15', // 日期
            task: 5, // 任务
            task_end: 3, // 已完成任务
          },
          {
            time: '2019-12-14', // 日期
            task: 5, // 任务
            task_end: 3, // 已完成任务
          },
        ],
      },
    ],
    // ...more  可以添加更多人员
  },
];

// 数据3 周日历
export const date = [
  {
    time: '2019-12-14',
    // ...more 周信息,国定节假日等字段
  },
];

// 选取人员发数据:
export const addPeople = {
  id: 64,
  name: '姚芳丽',
  time: [],
  roleId: 8,
  projectId: '65762711',
};

// 默认事件列表
export const eventList = [
  {
    des: '3344',
  },
  {
    des: '3344',
  },
];

// 删除事件
export const delEvent = {
  projectId: '145',
  eventId: '3344',
};

// 添加事件
export const addEvent = {
  projectId: '145',
  date: '2012-3-2',
  desc: '3344',
};
